output("奇穴: [朝露][盛夏][枕上][瑰姿][乞巧][散余霞][晚晴][碎冰][妍姿][秋深][垂眉][红隙]")

--变量表
local v = {}

--主循环
function Main(g_player)
	--防打断读条
	if casting("回雪飘摇") and castprog() < 0.34 then return end

	--开剑舞
	if nobuff("剑舞") then
		cast("名动四方", true)
	end

	---------------------------------------------治疗目标
	--把治疗目标初始化为自己
	v["治疗目标"] = id()

	--查找团队中血量最少的队友，如果找到了并且血量比自己低，就把治疗目标设置为他
	v["血量最少队友"] = party("没状态:重伤", "不是自己", "距离<20", "视线可达", "气血最少")
	if v["血量最少队友"] ~= 0 and xlife(v["血量最少队友"]) < life() then
		v["治疗目标"] = v["血量最少队友"]
	end

	---------------------------------------------加血
	v["目标血量"] = xlife(v["治疗目标"])
	
	
	if v["目标血量"] < 0.5 then
		xcast("王母挥袂", v["治疗目标"], true)
		xcast("风袖低昂", v["治疗目标"], true)
	end


	--治疗目标是当前正在读条回雪的目标
	if casting("回雪飘摇") and v["治疗目标"] == casttarget() then
		return
	end

	if v["目标血量"] < 0.9 then
		if xbufftime("上元点鬟", v["治疗目标"]) < -1 then
			xcast("上元点鬟", v["治疗目标"], true)
		end
		if xbufftime("翔舞", v["治疗目标"]) < -1 then
			xcast("翔鸾舞柳", v["治疗目标"], true)
		end
	end
	
	if v["目标血量"] < 0.8 then
		xcast("回雪飘摇", v["治疗目标"], true)
	end

	--给T上持续
	xcast("上元点鬟", party("没状态:重伤", "距离<20", "内功:洗髓经|铁牢律|明尊琉璃体|铁骨衣", "视线可达", "我的buff时间:上元点鬟<-1"))
	xcast("翔鸾舞柳", party("没状态:重伤", "距离<20", "内功:洗髓经|铁牢律|明尊琉璃体|铁骨衣", "视线可达", "我的buff时间:翔舞<-1"))

end
