output("奇穴: [反佐][月见][不染][妒茵][畅和][忘忧][同梦][飘黄][配伍][决明][莲池][卫矛]")

--变量表
local v = {}

--主循环
function Main(g_player)
	
	if life() < 0.5 then
		cast("七情和合")
	end

	--青川濯莲, 放在敌对目标脚下
	if fight() and rela("敌对") and tstate("站立|被击倒|眩晕|定身|锁足|爬起") then
		cast("青川濯莲")
	end

	--把治疗目标初始化为自己
	v["治疗目标"] = id()

	--查找团队中血量最少的队友，如果比自己的血量低，就把治疗目标设置为他
	v["血量最少队友"] = party("没状态:重伤", "不是自己", "距离<20", "视线可达", "没载具", "气血最少")
	if v["血量最少队友"] ~= 0 and xlife(v["血量最少队友"]) < life() then		--找到了，并且血量小于自己的血量
		v["治疗目标"] = v["血量最少队友"]
	end


	v["治疗目标血量"] = xlife(v["治疗目标"])


	if v["治疗目标血量"] < 0.7 then
		xcast("当归四逆", v["治疗目标"])
	end

	if v["治疗目标血量"] < 0.95 then
		if yaoxing() < 0 then
			xcast("白芷含芳", v["治疗目标"])
			
		end
		xcast("赤芍寒香", v["治疗目标"])
	end
end

--[[
龙葵自苦, 2 寒性
赤芍寒香, 2 寒性
白芷含芳, 1 温性
当归四逆, 4 温性
--]]
