--该文件为技能相关数据配置文件, 如有错误和遗漏 Github 发 Issue

--需要记录释放时间的技能, 键是技能ID, 值是技能名, 下面两个表中有的技能可以用 lasttime tlasttime xlasttime 获取释放时间
--只记录比较重要和CD较长的技能, 例如 普渡四方 这种没有特殊效果, CD又短的技能, 记录释放时间没什么意义还浪费资源
--同时也用于技能开关菜单, 在表中的技能才会显示在技能开关中
local tCast = {}		--瞬发、读条技能
local tChannel = {}		--引导技能

--江湖
tCast[9002] = "扶摇直上"
tCast[9003] = "蹑云逐月"
tCast[9004] = "迎风回浪"
tCast[9005] = "凌霄揽胜"
tCast[9006] = "瑶台枕鹤"
tCast[9007] = "后撤"


--少林
tCast[235] = "横扫六合"
tCast[236] = "摩诃无量"
tCast[238] = "捕风式"
tCast[242] = "捉影式"
tCast[252] = "大狮子吼"
tCast[18624] = "大狮子吼"	--[狮啸]
tCast[18604] = "千斤坠"
tCast[245] = "罗汉金身"
tCast[15165] = "二业依缘"	--袈裟
tCast[15166] = "二业依缘"	--伏魔
tCast[260] = "擒龙诀"
tCast[258] = "舍身诀"
tCast[261] = "无相诀"
tCast[31906] = "无相诀·无色"
tCast[257] = "锻骨诀"
tCast[240] = "抢珠式"
tCast[259] = "轮回诀"
tCast[32650] = "断诸邪见"
tCast[24819] = "醍醐灌顶"

tCast[2589] = "归去来棍"
tCast[15195] = "舍身弘法"


--万花
tCast[132] = "春泥护花"
tCast[131] = "碧水滔天"
tCast[100] = "星楼月影"
tCast[136] = "水月无间"
tCast[228] = "太阴指"
tCast[182] = "玉石俱焚"
tCast[186] = "芙蓉并蒂"
tCast[2645] = "乱洒青荷"
tCast[183] = "厥阴指"
tCast[28464] = "守拙"
tCast[24916] = "乘墨由心"
tCast[28465] = "天工甲士"
tCast[14965] = "南风吐月"
tCast[24919] = "洛川神韵"

tCast[2663] = "听风吹雪"	--离经
tCast[24913] = "听风吹雪"	--[空山]
tCast[34102] = "归园"
tCast[32381] = "落子无悔"
tCast[14963] = "折叶笼花"
tCast[24911] = "大针"


--天策
tCast[480] = "沧月"
tChannel[18240] = "沧月"	--[千驰]
tCast[412] = "疾如风"
tCast[404] = "撼如雷"
tCast[413] = "守如山"
tCast[422] = "啸如虎"
tCast[442] = "御"
tCast[418] = "突"
tCast[424] = "疾"
tCast[428] = "断魂刺"
tCast[433] = "任驰骋"
tCast[2603] = "乘龙箭"
tCast[426] = "破坚阵"
tCast[32893] = "临阵"
tCast[2611] = "霹雳"
tCast[32983] = "挥金镝"
tCast[33334] = "挥金镝"		--马上
tCast[2628] = "渊"
tCast[15158] = "破重围"
tCast[24842] = "力破万钧"

tCast[482] = "崩"
tCast[15115] = "号令三军"


--纯阳
tCast[358] = "生太极"
tCast[359] = "破苍穹"
tCast[371] = "镇山河"
tCast[6911] = "镇山河"		--[心眼]
tCast[24946] = "镇山河"		--[破势]
tCast[303] = "三才化生"
tCast[368] = "六合独尊"
tCast[18668] = "六合独尊"	--[浮生]
tChannel[18640] = "万世不竭"
tCast[2674] = "五方行尽"
tCast[305] = "九转归一"
tCast[312] = "坐忘无我"
tCast[2681] = "紫气东来"
tCast[346] = "梯云纵"
tCast[355] = "凭虚御风"
tCast[357] = "化三清"
tCast[370] = "八卦洞玄"
tCast[36099] = "六爻有兆"
tCast[23969] = "剑出鸿蒙"
tCast[24955] = "穹隆化生"

tCast[372] = "转乾坤"
tCast[362] = "碎星辰"
tCast[363] = "吞日月"
tCast[311] = "万剑归宗"
tCast[366] = "大道无术"
tCast[2699] = "八荒归元"
tCast[588] = "人剑合一"
tCast[2690] = "剑冲阴阳"
tCast[18751] = "剑冲阴阳"	--[随物]
tCast[310] = "剑飞惊天"
tCast[22705] = "坐忘无我"	--[不争]
tCast[32447] = "剑道万象"
tCast[15187] = "行天道"
tCast[24972] = "凌云剑"
tCast[24974] = "凌云剑·破"


--七秀
tCast[2716] = "剑破虚空"
tCast[546] = "剑影留痕"
tCast[544] = "帝骖龙翔"
tCast[557] = "天地低昂"
tCast[18585] = "水榭花盈"
tCast[558] = "雷霆震怒"
tCast[33104] = "雷霆震怒"	--[缠竹]
tCast[568] = "繁音急节"
tCast[574] = "蝶弄足"
tCast[550] = "鹊踏枝"
tCast[563] = "剑转流云"
tChannel[25006] = "月出东山"
tCast[547] = "剑心通明"
tCast[23934] = "广陵月"
tCast[21166] = "霜天剑泠"
tCast[32636] = "合璧知意"

tCast[569] = "王母挥袂"
tCast[555] = "风袖低昂"
tCast[28998] = "红绡倩风"
tCast[21722] = "点绛唇"
tCast[18221] = "余寒映日"
tCast[24990] = "九微飞花"
tCast[32781] = "韶景芳尘"
tCast[30850] = "泠风解怀"
tChannel[36142] = "雾霭纤流"
tChannel[567] = "左旋右转"


--五毒
tCast[3702] = "玄水蛊"
tCast[2220] = "凤凰蛊"
tCast[25020] = "凤凰蛊"		--[荒息]
tCast[2223] = "灵蛇引"
tCast[34663] = "灵蛇引"	--[驭虫]
tCast[2225] = "天蛛引"
tCast[34665] = "天蛛引"	--[驭虫]
tCast[2222] = "玉蟾引"
tCast[34662] = "玉蟾引"	--[驭虫]
tCast[2221] = "圣蝎引"
tCast[34661] = "圣蝎引"	--[驭虫]
tCast[2224] = "风蜈引"
tCast[34664] = "风蜈引"	--[驭虫]
tCast[2226] = "蛊虫献祭"
tCast[2228] = "化蝶"
tCast[29545] = "篾片蛊"
tCast[2227] = "蛊虫狂暴"
tCast[30540] = "忘攸蛊"
tChannel[32753] = "寂灭蛊"
tCast[34654] = "怀泽蛊"
tCast[15121] = "蚀心蛊"
tChannel[25043] = "连缘蛊"

tCast[2965] = "碧蝶引"
tCast[2231] = "蛊惑众生"
tCast[2957] = "圣手织天"
tCast[2235] = "千蝶吐瑞"
tCast[2230] = "女娲补天"
tCast[2234] = "仙王蛊鼎"
tCast[32824] = "孔雀引"
tCast[34651] = "娲皇赐恩"
tCast[15132] = "迷仙引梦"
tCast[25058] = "圣元阵"


--唐门
tCast[3091] = "孔雀翎"
tCast[3089] = "雷震子"
tCast[3090] = "迷神钉"
tCast[3109] = "千机变"
tCast[3368] = "连弩形态"
tCast[3369] = "重弩形态"
tCast[3370] = "毒刹形态"
tCast[3108] = "天绝地灭"
tCast[3110] = "鬼斧神工"
tCast[21847] = "风雷·鬼斧神工"	--[九霄风雷]
tCast[18481] = "子母飞爪"
tCast[3094] = "心无旁骛"
tCast[3118] = "鸟翔碧空"
tCast[3119] = "鸟翔碧空·滞空"
tCast[3112] = "浮光掠影"
tCast[3114] = "惊鸿游龙"
tCast[3103] = "飞星遁影"
tCast[3115] = "荆天棘地"
tCast[3092] = "梅花针"
tCast[30723] = "千机连环"
tCast[32742] = "诡鉴冥微"
tCast[28456] = "不负霜雪"
tCast[18675] = "千秋万劫"
tCast[25151] = "诡面埋伏"

tCast[3096] = "追命箭"
tCast[3101] = "逐星箭"
tCast[3098] = "穿心弩"
tCast[30588] = "凝形逐踪"
tCast[34644] = "敛影无锋"
tChannel[18672] = "百里追魂"
tCast[25132] = "流火连星"


--藏剑
tCast[1579] = "九溪弥烟"
tCast[1577] = "玉虹贯日"
tCast[1580] = "玉泉鱼跃"
tCast[1589] = "梦泉虎跑"
tCast[18322] = "鹤归孤山"
tChannel[1645] = "风来吴山"
tCast[18333] = "风来吴山"		--[层云]
tCast[1613] = "峰插云景"
tCast[1649] = "醉月"
tCast[1656] = "啸日"
tCast[1663] = "莺鸣柳"
tCast[1666] = "泉凝月"
tCast[1668] = "云栖松"
tCast[1665] = "风吹荷"
tCast[36275] = "山岳乘风"
tCast[1647] = "惊涛"
tCast[1610] = "霞流宝石"
tCast[29093] = "剑锋百锻"
tCast[32673] = "剑引龙泉"
tCast[14910] = "松舍问霞"
tCast[25070] = "飞来闻踪"


--丐帮
tCast[5361] = "恶狗拦路"
tCast[5259] = "棒打狗头"
tCast[5257] = "蜀犬吠日"
tCast[32704] = "蜀犬吠日"	--[仁德]
tCast[18523] = "乘龙戏水"
tCast[5267] = "龙啸九天"
tChannel[5268] = "酒中仙"
tChannel[5270] = "笑醉狂"
tCast[25186] = "将进酒"
tCast[25197] = "祭湘君"
tCast[28989] = "城复于隍"
tCast[14927] = "御鸿于天"


--明教
tCast[3973] = "贪魔体"
tCast[3970] = "幻光步"
tCast[18633] = "幻光步"		--[秘影诡行]
tCast[3969] = "光明相"
tCast[3974] = "暗尘弥散"	--非战斗 4043 清CD
tCast[3977] = "流光囚影"
tCast[4910] = "无明魂锁"
tCast[3975] = "怖畏暗刑"
tCast[3961] = "寒月耀"
tCast[18626] = "伏明众生"
tCast[3978] = "生灭予夺"
tCast[3971] = "极乐引"
tCast[32661] = "清静心"
tCast[34347] = "悬象著明"
tCast[22743] = "明齐日月"
tCast[28593] = "日月晦"
tCast[18629] = "冥月渡心"
tCast[25171] = "微妙风"

tCast[3982] = "慈悲愿"
tChannel[3985] = "朝圣言"
tCast[3984] = "渡厄力"
tCast[14922] = "心火叹"
tCast[25175] = "微妙风"


--苍云
tCast[13046] = "盾猛"
tCast[25204] = "盾猛"	--[扶阵]
tCast[13050] = "盾飞"
tCast[13049] = "盾墙"
tCast[13424] = "撼地"
tCast[13068] = "盾毅"
tCast[13040] = "血怒"
tCast[13042] = "无惧"
tCast[13070] = "盾壁"
tCast[13067] = "盾立"
tCast[34912] = "业火麟光"
tCast[13069] = "盾抛"
tCast[30769] = "阵云结晦"
tCast[29066] = "矢尽兵穷"
tCast[32619] = "祭血关山"
tCast[15196] = "扬旌沙场"
tCast[25213] = "断马摧城"

tCast[15072] = "寒啸千军"


--长歌
tCast[14229] = "高山流水"	--主动
tCast[14232] = "平沙落雁"	--主动
tCast[14076] = "青霄飞羽"
tCast[14075] = "云生结海"
tCast[14224] = "云生结海"	--瞬发
tCast[14074] = "江逐月天"
tCast[14223] = "江逐月天"	--瞬发
tCast[14154] = "迴梦逐光"
tCast[14225] = "迴梦逐光"	--瞬发
tCast[14073] = "笑傲光阴"
tCast[14222] = "笑傲光阴"	--瞬发
tCast[14082] = "疏影横斜"
tCast[14083] = "清绝影歌"
tCast[14081] = "孤影化双"
tCast[14084] = "杯水留影"
tCast[14095] = "清音长啸"
tCast[18707] = "啸影"
tCast[34344] = "正律和鸣"
tCast[15068] = "琴音共鸣"
tChannel[29071] = "不愧君"

tCast[29003] = "敛意"
tCast[25229] = "游太清"


--霸刀
tCast[16633] = "踏宴扬旗"	--大刀
tCast[16460] = "踏宴扬旗"	--双刀
tCast[16629] = "雷走风切"	--大刀
tCast[16598] = "雷走风切"	--双刀
tCast[16454] = "西楚悲歌"
tCast[16627] = "上将军印"
tCast[19344] = "上将军印"	--七刀
tCast[16479] = "割据秦宫"
tCast[16608] = "散流霞"
tCast[17057] = "闹须弥"
tCast[16870] = "擒龙六斩"
tCast[16459] = "临渊蹈河"
tCast[16621] = "坚壁清野"
tCast[16455] = "楚河汉界"
tCast[16620] = "封渊震煞"
tCast[33123] = "扬刀激尘"
tCast[28680] = "鸣震九霄"
tCast[21858] = "降麒式"
tCast[25095] = "横断山河"


--蓬莱
tCast[20245] = "定波砥澜"
tCast[20733] = "定波砥澜"	--[怅归]
tCast[36282] = "定波砥澜"	--[烟涛]
tCast[19827] = "翼绝云天"
tCast[20259] = "振翅图南"
tCast[19984] = "驭羽骋风"
tCast[21772] = "驭羽骋风"	--[横绝]
tCast[21145] = "驭羽骋风"	--[倾盖]
tCast[20281] = "疾电叱羽"
tCast[24017] = "疾电叱羽"
tCast[20053] = "跃潮斩波"
tCast[19828] = "浮游天地"
tCast[20049] = "物化天行"
tCast[20285] = "逸尘步虚"
tCast[20286] = "逸尘步虚"	--左
tCast[20287] = "逸尘步虚"	--右
tCast[20288] = "逸尘步虚"	--后
tCast[20084] = "逐波灵游"
tCast[20804] = "逐波灵游"	--[冥意]
tCast[20641] = "空桑舞瑟"
tCast[20065] = "翔极碧落"
tCast[20601] = "鸿渐于飞"
tCast[20837] = "澹然若海"
tCast[25285] = "飞倾列缺"


--凌雪
tCast[22150] = "骤雨寒江"
tChannel[22320] = "乱天狼"
tCast[22321] = "隐风雷"
tChannel[22358] = "斩无常"
tChannel[22647] = "斩无常"	--[殷炽]
tCast[22274] = "血覆黄泉"
tCast[22361] = "幽冥窥月"
tCast[22460] = "铁马冰河"
tCast[22614] = "孤风飒踏"
tCast[22344] = "日月吴钩"
tCast[22360] = "崔嵬鬼步"
tCast[23380] = "崔嵬鬼步"	--[折意]
tCast[22417] = "十方玄机"
tCast[29162] = "十方玄机"	--[渊秘]
tCast[23971] = "无间狱"
tCast[29166] = "飞刃回转"
tCast[22602] = "横云意"
tCast[32843] = "尽荒狱"
tCast[36286] = "赴尘劫"
tCast[29173] = "链魂"
tCast[22603] = "青山共我"
tCast[25315] = "修罗暗度"


--衍天
tCast[24373] = "往者定"
tCast[24374] = "踏星行"
tCast[24375] = "起卦"
tCast[24491] = "变卦"
tCast[24378] = "奇门飞宫"
tCast[24379] = "鬼星开穴"
tCast[24380] = "返闭惊魂"
tCast[24383] = "天人合一"
tCast[25142] = "巨门北落"
tCast[24382] = "斗转星移"
tCast[25139] = "斗转星移"	--[延年]
tCast[24385] = "鸿蒙天禁"
tCast[32810] = "鸿蒙天禁"	--[坍缩] 33038 蓄力
tCast[25107] = "鸿蒙天禁"	--[天钺]
tCast[25011] = "神皆寂"
tCast[25114] = "龙马出河"
tCast[34681] = "荧惑守心"
tCast[32796] = "逆火"
tCast[25176] = "杀星在尾"
tCast[25383] = "连极阵"


--药宗
tChannel[27556] = "川乌射罔"
tCast[27578] = "沾衣未妨"
tChannel[27582] = "且待时休"
tCast[27642] = "凌然天风"
tCast[27536] = "惊鸿掠水"
tCast[32902] = "惊鸿掠水"	--[肃羽]
tCast[27635] = "含锋破月"
tCast[28486] = "含锋破月"	--[划云]
tCast[27652] = "苍棘缚地"
tCast[27667] = "紫叶沉疴"
tCast[33137] = "紫叶沉疴"	--[紫伏]
tCast[27674] = "逐云寒蕊"
tCast[27897] = "绿野蔓生"
tCast[28429] = "绿野蔓生"	--[双生]
tCast[30016] = "南草"
tCast[32896] = "应理与药"
tCast[36067] = "香繁饮露"
tCast[28533] = "青圃着尘"
tCast[28583] = "并蒂夺株"

tChannel[27623] = "当归四逆"
tCast[27630] = "龙葵自苦"
tCast[28620] = "七情和合"
tCast[28647] = "惊鸿掠水"	--[水苏]
tCast[27669] = "青川濯莲"
tCast[27675] = "枯木苏息"	--读条结束 释放 29214 进CD
tCast[28740] = "旋生飞草"
tCast[36059] = "岚微香馥"
tCast[32897] = "应时与药"
tCast[36170] = "犹解倒悬"
tCast[29471] = "青圃着尘"
tCast[28756] = "百药宣时"


--刀宗
tCast[32133] = "停云势"
tCast[32134] = "决云势"
tCast[32135] = "断云势"
tCast[32174] = "凝云势"
tCast[32140] = "驰风八步"
tCast[32419] = "灭影追风"
tCast[32142] = "游风飘踪"
tCast[32144] = "横云断浪"
tCast[32145] = "孤锋破浪"
tCast[32147] = "洗兵雨"
tCast[32148] = "触石雨"
tCast[32465] = "遏云势"
tCast[32665] = "泽风同承"
tCast[32614] = "怒锋倾涛"


--万灵
tCast[35661] = "饮羽簇"
tCast[35670] = "空弦惊雁"
tCast[35671] = "金乌见坠"
tCast[35681] = "汇灵合契"
tCast[35682] = "澄神醒梦"
tCast[35683] = "应天授命"
tCast[35684] = "游雾乘云"
tCast[35695] = "引风唤灵"
tCast[35696] = "弛律召野"
tCast[35697] = "风尽浮生"
tCast[35754] = "丛云隐月"
tCast[35755] = "涉野徙林"
tChannel[35764] = "朝仪万汇"
tCast[35765] = "白虹贯日"
tCast[36172] = "白虹贯日"	--35765蓄力后实际释放


--需要记录出现时间的NPC，键是模板ID, 值是持续时间(毫秒)
local tNpcData = {}
tNpcData[3080]	= 9000		--气场化三清
tNpcData[4976]	= 24000		--气场生太极
tNpcData[4977]	= 24000		--气场破苍穹
tNpcData[4978]	= 24000		--气场冲阴阳
tNpcData[4979]	= 24000		--气场凌太虚
tNpcData[4980]	= 24000		--气场碎星辰
tNpcData[4981]	= 24000		--气场吞日月
tNpcData[4982]	= 8000		--气场镇山河
tNpcData[57807] = 12000		--行天道
tNpcData[58295] = 5000		--六合独尊
tNpcData[53233] = 4000		--西楚悲歌


--返回数据
return { tCast, tChannel, tNpcData }
